#include <stdio.h>

int main(void)
{
    const double RENT = 3852.99; // const 变量
    printf("*%f*\n", RENT); // 十进制浮点数 正常输出 默认保留6位小数 *3852.990000*
    printf("*%e*\n", RENT); // 十进制浮点数 科学计数法输出 默认宽度 *3.852990e+03*
    printf("*%4.2f*\n", RENT); // 十进制浮点数 正常输出 最小宽度4 保留2位小数 *3852.99*
    printf("*%3.1f*\n", RENT); // 最小宽度3 保留1位小数 *3853.0*
    printf("*%10.3f*\n", RENT); // 最小宽度10 保留3位小数 *  3852.990*
    printf("*%10.3E*\n", RENT); // 最小宽度10 保留3位小数 科学计数法输出 * 3.853E+03*
    printf("*%+4.2f*\n", RENT); // 最小宽度4 保留2位小数 带正负号 *+3852.99*
    printf("*%010.2f*\n", RENT); // 最小宽度10 保留2位小数 空位以0补全 *0003852.99*

    return 0;
}